/***************************************
 问题描述：请每年的1，3，5，7，8，10，12月有31天，4，6，9，11月有30天，闰年2月29天，其他年份2月28天，
 给定年份和月份求该月的天数
 
 输入说明：输入由两个正整数a和b构成，a表示年份，b表示月份，a和b之间用空格分隔
  
 输出说明：根据年份和月份计算该月天数并输出
 
 输入样例：
	输入样例1
	2000 3
	输入样例2
	2001 2
 
 输出样例: 
 	输出样例1
	31
	输出样例2
	28
 ****************************************/ 
#include <stdio.h>
int main()
{
    int a,b,t = 0;
    scanf("%d%d",&a,&b);
    if((a%4 == 0 && a%100 !=0) || (a%100 == 0 && a%400 == 0))
    {
    	if(b == 2) t = 29;
	}
	else if (b == 2) t = 28;
	
	if(b == 1 || b == 3 || b == 5 || b == 7 || b == 8 || b == 10 || b == 12) t = 31;
	else if(b == 4 || b == 6 || b == 9 || b == 11) t = 30; 
    
	printf("%d\n",t);
	return 0;	
}
