/************************************************
 * 下列程序展示强制类型转换，整数相除、求余运算 
 * 编译该程序，观察并分析程序运行结果.
 * 注：严禁"粘贴","复制"，请键盘输入，体会程序编译调试过程。 
 ************************************************/ 
#include <stdio.h>
#include <stdlib.h>
int main()
{ 
     int a=2,b=3;
     float x=3.5,y=2.5;
     
     // (1)
     printf("(1): %f\n",(float)(a+b)/2+(int)x%(int)y);  // 3.5
     
     // (2) 注，整数/整数的结果是整数，不能把%d写为%f,格式描述符必须与变量类型一致 
     printf("(2): %d\n",(a+b)%2+(int)y/(int)x);  // 1
     
     // (3)
     printf("(3): %d\n",a=(2*a*b)%(b%2));  // 0
    
    
    system("pause");
    return 0;
}
