/************************************************
 * 下列程序展示字符及其对应的ASCII码之间的关系。 
 * 编译该程序，观察并分析程序运行结果.
 * 注：严禁"粘贴","复制"，请键盘输入，体会程序编译调试过程。 
 ************************************************/ 
#include <stdio.h>
#include <stdlib.h>
int main()
{ 
    char ch;
    
    // 每次运行程序前，注释下列三条语句中的其中两项，即给ch赋值为不同的字符，观察并分析运行结果。 
    ch = 'A';   
    //ch = 'a';
    //ch = '1';
    
    printf("\'%c\'字符的ASCII编码是%d\n",ch,ch);
    
    if (ch>='A' && ch<='Z')  // ASCII码表中"大写字符连续排列"，因此可以这样判断 
    {
       printf("\'%c\'是大写字符.\n", ch); 
    }
    else if (ch>='a' && ch<='z') // ASCII码表中"小写字符连续排列"，因此可以这样判断
    { 
       printf("\'%c\'是小写字符.\n", ch); 
    }
    else if (ch>='0' && ch<='9') {  // ASCII码表中"数字字符连续排列"，因此可以这样判断
      printf("\'%c\'是数字字符.\n", ch); 
      int i = ch - '0';  // 数字字符数字本身（整数值）= 该数字字符的ASCII编码 - '0' 
      printf("\'%c\'字符的ASCII编码是%d,数字(整数值)是%d\n",ch,ch,i);
    }
    
    printf("相应大小写字符的差值：%d\n",'a'-'A'); // 32 
    
    // 如果ch是大写字符，转为小写字符，否则，保持不变.
    // ch = 'A'<=ch && ch<='Z' ? ch+32 : ch;
    ch = 'A'<=ch && ch<='Z' ? ch+'a'-'A' : ch;  // 等效 
    printf("转换为小写字符：%c\n",ch); 
    system("pause");
    return 0;
}
