/***********************************************************************************
	试题编号	8
	试题名称	阶梯电价计费
	时间限制:	2 秒
	内存限制:	10000MB
	问题描述	
	问题描述
	电价分三个档次，[0,110]度电，每度电0.5元；(110,210]度电，超出110部分每度电0.55元，超过210度电，超出210部分每度电0.70元，给出一个家庭一月用电量，请计算出应缴的电费（四舍五入，保留小数点后两位小数）。
	输入说明
	输入数据为一个个正实数，表示一月用电量
	输出说明
	输出应缴电费，四舍五入保留2位小数。
	输入样例
	输入样例1 
	100 
	输入样例2 
	200 
	输入样例3 
	329.75
	输出样例
	输出样例1 
	50.00 
	输出样例2 
	104.50 
	输出样例3 
	193.82
	提示信息

    注：本题采用编译系统默认保留小数位数的方法。GNU/C++采用以下规则保留小数位。

	四舍六入五成双： 
    对于位数很多的近似数，当有效位数确定后，其后面多余的数字应该舍去，只保留有效数字最末一位，
	这种修约（舍入）规则是"四舍六入五成双"，也即"4舍6入5凑偶"，
	这里"四"是指≤4 时舍去，"六"是指≥6时进上，"五"指的是根据5后面的数字来定，当5后有数时，舍5入1；
	当5后无有效数字时，需要分两种情况来讲：
   （1）5前为奇数，舍5入1；
   （2）5前为偶数，舍5不进（0是偶数）。
 
	printf("%.2f\n",193.825); // 193.82, 四舍六入五留双 
	printf("%.2f\n",193.826); // 193.83，四舍五入  
	printf("%.1f\n",193.85); // 193.8, 四舍六入五留双 
	printf("%.1f\n",193.86); // 193.9，四舍五入  
	printf("%.0f\n",193.4); // 193, 四舍五入  
	printf("%.0f\n",193.5); // 194, 四舍五入  
	printf("%.0f\n",193.6); // 194，四舍五入  
 ***********************************************************************************/
#include <stdio.h>

int main()
{

	
	float sum,u1=0.5,u2=0.55,u3=0.70; // 用电量,每度电单价
	float fee = 0; // 应缴电费
	
	scanf("%f",&sum);
    
    if (sum > 210) 
	{
		fee = (sum-210)*u3;
		sum = 210;
	}
	if (sum > 110)
	{
		fee += (sum-110)*u2;
		sum = 110;
	}
	fee += sum*u1;
    
	printf("%.2f\n",fee);
	return 0;
} 

int main2()
{
	float sum,u1=0.5,u2=0.55,u3=0.70; // 用电量,每度电单价
	float fee = 0; // 应缴电费 
	scanf("%f",&sum);

    if (sum >= 210)
		fee = 110*u1 + (210-110)*u2 + (sum-210)*u3;
	else if (sum >= 110)
	    fee = 110*u1 + (sum-110)*u2;
	else 
		fee = sum*u1; 
	
	printf("%.2f\n",fee);
	return 0;
} 

int main3()
{
	float sum,u1=0.5,u2=0.55,u3=0.70; // 用电量,每度电单价
	float fee = 0; // 应缴电费 
	
	scanf("%f",&sum);
    
    if (sum <= 110) fee = sum*u1;
    else if (sum <= 210)
	{
		fee = 110*u1;
		sum -= 110; 
		fee += sum*u2;
    }
    else // sum > 210
	{
		fee = 110*u1; 
		fee += (210-110)*u2;
		sum -= 210;
		fee += sum*u3;
    }
	
	printf("%.2f\n",fee);
	return 0;
} 

